InformationRegisters/ШтрихкодыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ШтрихкодыНоменклатуры</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТипШтрихкода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ШтрихкодыНоменклатуры/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.СформироватьНовый Тогда
		Запись.Штрихкод = РегистрыСведений.ШтрихкодыНоменклатуры.СформироватьШтучныйШтрихКодEAN13();
		Запись.Номенклатура = Параметры.Номенклатура;
		Запись.ХарактеристикаНоменклатуры = Параметры.Характеристика;
		Запись.ТипШтрихкода = Перечисления.ТипыШтрихкодов.EAN13;
	КонецЕсли;
КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////
//// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

//&НаСервере
//Функция  ПолучитьПрефиксВесовогоШК()
//	ПрефиксВесовогоШК = Строка(Справочники.ФорматыШтрихКодов.Весовой.Префикс);
//	Возврат ПрефиксВесовогоШК;
//КонецФункции


//// Функция проверяет существование штрих-кода с записываемыми данными
////
//// Параметры:
////  ШтрихкодНеИспользуется - Булево или Неопределено - использование найденного ШК;
////                           заполняется функцией
////
//// Возвращаемое значение:
////  Булево - Истина, если ШК был найден
////
//&НаСервере
//Функция ЕстьТочнаяКопияШтрихКода(ШтрихкодНеИспользуется = Неопределено)
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = 
//	"ВЫБРАТЬ
//	|	ШтрихкодыНоменклатуры.Номенклатура,
//	|	ШтрихкодыНоменклатуры.НеИспользуется
//	|ИЗ
//	|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
//	|ГДЕ
//	|	ШтрихкодыНоменклатуры.Штрихкод = &ШтрихКод
//	|	И ШтрихкодыНоменклатуры.Номенклатура = &ТекТовар
//	|	И ШтрихкодыНоменклатуры.ЕдиницаИзмерения = &Единица
//	|	И ШтрихкодыНоменклатуры.ХарактеристикаНоменклатуры = &Характеристика";
//	
//	Запрос.УстановитьПараметр("ШтрихКод", Запись.Штрихкод);
//	Запрос.УстановитьПараметр("ТекТовар", Запись.Номенклатура);
//	Запрос.УстановитьПараметр("Единица",  Запись.ЕдиницаИзмерения);
//	Запрос.УстановитьПараметр("Характеристика", Запись.ХарактеристикаНоменклатуры);
//	
//	Выборка = Запрос.Выполнить().Выбрать();
//	
//	Если Выборка.Следующий() Тогда
//		ШтрихкодНеИспользуется = Выборка.НеИспользуется;
//		Возврат Истина;
//	Иначе
//		Возврат Ложь;
//	КонецЕсли;
//	
//КонецФункции

//// Устанавливает отображение поля ввода ХарактеристикиНоменклатуры
//// по значению поля Номенклатура
////
//&НаСервере
//Процедура ОбновитьОтображениеХарактеристики()
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст =
//	"ВЫБРАТЬ
//	|	Номенклатура.ИспользоватьХарактеристикиНоменклатуры КАК ИспользоватьХарактеристикиНоменклатуры
//	|ИЗ
//	|	Справочник.Номенклатура КАК Номенклатура
//	|ГДЕ
//	|	Номенклатура.Ссылка = &Ссылка";
//	
//	Запрос.УстановитьПараметр("Ссылка", Запись.Номенклатура);
//	
//	Результат = Запрос.Выполнить();
//	
//	Если НЕ Результат.Пустой() Тогда
//		
//		Выборка = Результат.Выбрать();
//		Выборка.Следующий();
//		
//		Если Выборка.ИспользоватьХарактеристикиНоменклатуры Тогда
//			
//			Элементы.ХарактеристикаНоменклатуры.Доступность = Истина;
//			Элементы.ХарактеристикиНадпись.Заголовок = "Штрих-код с ""пустой"" харктеристикой будет привязан ко всем характеристикам";
//		Иначе
//			
//			Элементы.ХарактеристикаНоменклатуры.Доступность = Ложь;
//			Запись.ХарактеристикаНоменклатуры = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
//			Элементы.ХарактеристикиНадпись.Заголовок = "Характеристики не используются";
//		КонецЕсли;
//		
//	Иначе
//		
//		Элементы.ХарактеристикаНоменклатуры.Доступность = Истина;
//		Элементы.ХарактеристикиНадпись.Заголовок = "Характеристики не используются";
//		
//	КонецЕсли;
//	
//КонецПроцедуры // ОбновитьОтображениеХарактеристики()

//// Обновляет отображение элементов формы
////
//&НаСервере
//Процедура ПриИзмененииНоменклатурыСервер()

//	БазоваяЕдиницаИзмеренияНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.Номенклатура, "ЕдиницаИзмерения");
//			
//	Если НЕ Элементы.ХарактеристикаНоменклатуры.ТолькоПросмотр Тогда
//		ОбновитьОтображениеХарактеристики();
//	КонецЕсли;
//	
//	Если ЗначениеЗаполнено(Запись.ЕдиницаИзмерения) Тогда
//		ЕдиницаНоменклатуры = Запись.ЕдиницаИзмерения;
//	Иначе
//		ЕдиницаНоменклатуры = БазоваяЕдиницаИзмеренияНоменклатуры;
//	КонецЕсли;
//	
//КонецПроцедуры // ПриИзмененииНоменклатурыСервер()

//// Заполняет поля Штрихкод и ТипШтрихкод новыми значениями
////
//&НаСервере
//Процедура СформироватьНовыйШтрихкодEAN13()

//	Запись.Штрихкод = РегистрыСведений.ШтрихкодыНоменклатуры.СформироватьШтучныйШтрихКодEAN13();
//	Запись.ТипШтрихкода = Перечисления.ТипыШтрихкодов.EAN13;

//КонецПроцедуры // СформироватьНовыйШтрихкодEAN13()

//// Функция осуществляет проверку уникальности штрих-кода штучного товара
////
//// Параметры
////  ШтрихКод          - <Строка> - проверяемый штрих-код.
////  Код               - <Число>  - параметр содержит измерение Код регистра сведений ШтрихкодыНоменклатуры;
////                      позволяет исключить один элемент из рассматриваемого списка.
////
//// Возвращаемое значение:
////  <ТаблицаЗначений> - таблица, в которой содержится информация о найденных
////                      штрих-кодах
////
//&НаСервереБезКонтекста
//Функция ПолучитьДанныеДругойНоменклатурыПоШК(Штрихкод, Номенклатура, Характеристика, ЕдиницаИзмерения)
//	
//	Возврат РегистрыСведений.ШтрихкодыНоменклатуры.ПроверитьУникальностьШтрихкода(Штрихкод, Номенклатура, Характеристика, ЕдиницаИзмерения);
//	
//КонецФункции // ПроверитьУникальностьШтрихКода()

//// Процедура для неуникальных штрих-кодов выдает сообщение о невозможности
//// сохранения или выдает вопрос-предупреждение о записи дубля
////
//// Параметры
////  Штрихкод  - Строка - проверяемый ШК
////  Номенклатура  - СправочникСсылка.Номенклатура - номенклатура,
////                  для которой задается ШК
////  ХарактеристикаНоменклатуры  - СправочникСсылка.ХарактеристикиНоменклатуры - характеристика,
////                                для которой задается ШК
////  ЕдиницаИзмерения  - СправочникСсылка.ЕдиницыИзмерения - единица измерения номенклатуры,
////                      для которой задается ШК
////  Отказ  - Булево - устанавливается в Истина, если требуется прекратить запись
////
//&НаКлиентеНаСервереБезКонтекста
//Процедура ПроверитьУникальностьШтрихкода(Штрихкод, Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, Отказ, ДублиШтрихкодовРазрешены)
//	ДанныеШтрихкода = ПолучитьДанныеДругойНоменклатурыПоШК(Штрихкод, Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения);
//	Если ДанныеШтрихкода.Используется Тогда
//		
//		ТекстСообщения = НСтр("ru = 'Штрихкод ""%Штрихкод%"" уже используется у товара 
//									|%ПредставлениеТовара%.
//									|
//									|'");
//		
//		ПредставлениеТовара = ОбщегоНазначенияДУМКлиентСервер.СформироватьСтрокуИнформацииОТоваре(ДанныеШтрихкода.НаименованиеНоменклатуры,
//																								  ДанныеШтрихкода.Код,
//																								  ДанныеШтрихкода.Артикул,
//																								  ДанныеШтрихкода.НаименованиеХарактеристики);
//		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%Штрихкод%", ШтрихКод);
//		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ПредставлениеТовара%", ПредставлениеТовара);
//		
//		ТекстСообщенияОНаличииЗапретаДублей = ТекстСообщения + НСтр("ru = 'Дубли штрих-кодов запрещены. Штрих-код не сохранен.'");
//		
//		#Если НаКлиенте ИЛИ ТолстыйКлиентУправляемоеПриложение Тогда
//			Если ДублиШтрихкодовРазрешены Тогда
//				Ответ = Вопрос(ТекстСообщения + НСтр("ru = 'Записать дубль?'"), РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
//				Если Ответ = КодВозвратаДиалога.Нет Тогда 
//					Отказ = Истина;
//				КонецЕсли;
//			Иначе
//				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщенияОНаличииЗапретаДублей, , "Запись.Штрихкод", , Отказ);
//			КонецЕсли;
//		#Иначе
//			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщенияОНаличииЗапретаДублей, , "Запись.Штрихкод", , Отказ);
//		#КонецЕсли
//	КонецЕсли;
//КонецПроцедуры // ПроверитьУникальностьШтрихкодов()

//////////////////////////////////////////////////////////////////////////////////
//// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

//&НаКлиенте
//Процедура НоменклатураПриИзменении(Элемент)
//	
//	ПриИзмененииНоменклатурыСервер();
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ХарактеристикаНоменклатурыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	
//	УправлениеДиалогами.ПроверитьИспользованиеХарактеристик(Запись.Номенклатура, СтандартнаяОбработка);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	
//	СтандартнаяОбработка = Ложь;
//	ДанныеВыбора = УправлениеДиалогами.ПолучитьДанныеВыбораЕдиницыИзмерения(Запись.Номенклатура);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ЕдиницаИзмеренияОчистка(Элемент, СтандартнаяОбработка)
//	
//	СтандартнаяОбработка = Ложь;
//	ЕдиницаНоменклатуры = БазоваяЕдиницаИзмеренияНоменклатуры;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ЕдиницаИзмеренияАвтоПодбор(Элемент, Текст, ДанныеВыбора, Ожидание, СтандартнаяОбработка)
//	
//	СтандартнаяОбработка = Ложь;
//	ДанныеВыбора = УправлениеДиалогами.ПолучитьДанныеВыбораЕдиницыИзмерения(Запись.Номенклатура, Текст);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ЕдиницаИзмеренияОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
//	
//	СтандартнаяОбработка = Ложь;
//	ДанныеВыбора = УправлениеДиалогами.ПолучитьДанныеВыбораЕдиницыИзмерения(Запись.Номенклатура, Текст);
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ШтрихкодПриИзменении(Элемент)
//	
//	Если НЕ ЗначениеЗаполнено(Запись.ТипШтрихкода) Тогда
//		
//		Запись.ТипШтрихкода = Штрихкодирование.ОпределитьТипШтрихКода(Запись.Штрихкод);
//		
//	КонецЕсли;
//	
//КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////
//// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

//&НаСервере
//Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
//	
//	Элементы.ХарактеристикиНадпись.Видимость = Константы.ИспользоватьХарактеристикиНоменклатуры.Получить();
//	
//	Если ЗначениеЗаполнено(Параметры.Ключ) Тогда
//		
//		Элементы.Номенклатура.ТолькоПросмотр               = Истина;
//		Элементы.ХарактеристикаНоменклатуры.ТолькоПросмотр = Истина;
//		Элементы.ЕдиницаИзмерения.ТолькоПросмотр           = Истина;
//		Элементы.Штрихкод.ТолькоПросмотр                   = Истина;
//		Элементы.ТипШтрихкода.ТолькоПросмотр 			   = Истина;
//		
//	Иначе
//		
//		Если ЗначениеЗаполнено(Параметры.Характеристика) Тогда
//			Запись.ХарактеристикаНоменклатуры = Параметры.Характеристика;
//			Запись.Номенклатура = Параметры.Характеристика.Владелец;
//		КонецЕсли;
//		Если Параметры.ЗаблокироватьХарактеристику Тогда
//			Элементы.ХарактеристикаНоменклатуры.ТолькоПросмотр = Истина;
//			Элементы.Номенклатура.ТолькоПросмотр = Истина;
//		КонецЕсли;
//		
//		Если ЗначениеЗаполнено(Параметры.ЕдиницаИзмерения) Тогда
//			Запись.ЕдиницаИзмерения = Параметры.ЕдиницаИзмерения;
//			Если НЕ ЗначениеЗаполнено(Запись.Номенклатура) Тогда
//				Запись.Номенклатура = Параметры.ЕдиницаИзмерения.Владелец;
//			КонецЕсли;
//		КонецЕсли;
//		Если Параметры.ЗаблокироватьЕдиницуИзмерения Тогда
//			Элементы.ЕдиницаИзмерения.ТолькоПросмотр = Истина;
//			Элементы.Номенклатура.ТолькоПросмотр = Истина;
//		КонецЕсли;
//		
//		Если ЗначениеЗаполнено(Параметры.Номенклатура) Тогда
//			Запись.Номенклатура = Параметры.Номенклатура;
//		КонецЕсли;
//		Если Параметры.ЗаблокироватьНоменклатуру Тогда
//			Элементы.Номенклатура.ТолькоПросмотр = Истина;
//		КонецЕсли;
//		
//		Если ЗначениеЗаполнено(Параметры.Штрихкод) Тогда
//			Запись.Штрихкод = Параметры.Штрихкод;
//			Запись.ТипШтрихкода = Штрихкодирование.ОпределитьТипШтрихКода(Запись.Штрихкод);
//		ИначеЕсли Параметры.СформироватьНовый Тогда
//			СформироватьНовыйШтрихкодEAN13();
//		КонецЕсли;
//		
//		Если Параметры.Свойство("ЗаписатьДубльШК") Тогда
//			ЗаписатьДубльШК = Истина;
//		КонецЕсли;
//		
//		Модифицированность = Истина;
//		
//	КонецЕсли;
//	
//	Если ЗначениеЗаполнено(Запись.Номенклатура) Тогда
//		ПриИзмененииНоменклатурыСервер();
//	КонецЕсли;
//	
//	ТипШКEAN13 = Перечисления.ТипыШтрихкодов.EAN13;
//	ДублиШтрихкодовРазрешены = Константы.РазрешитьДублиШК.Получить();
//	
//КонецПроцедуры

//&НаСервере
//Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
//	
//	Если ЗначениеЗаполнено(Запись.Штрихкод)                                                                         // ШК типа EAN13 заполнен
//	 ИЛИ (ЗначениеЗаполнено(Запись.ТипШтрихкода) И Запись.ТипШтрихкода <> ТипШКEAN13) Тогда                         // или тип не EAN13
//		
//		Если НЕ Элементы.Штрихкод.ТолькоПросмотр И НЕ ДублиШтрихкодовРазрешены Тогда
//			// Если возможны дубли ШК, проверяем уникальность ШК на клиенте, иначе - на сервере
//			ПроверитьУникальностьШтрихкода(Запись.Штрихкод, Запись.Номенклатура, Запись.ХарактеристикаНоменклатуры, Запись.ЕдиницаИзмерения, Отказ, ДублиШтрихкодовРазрешены);
//		КонецЕсли;
//		
//		ШкНеИспользуется = Ложь;
//		Если ЕстьТочнаяКопияШтрихКода(ШкНеИспользуется) Тогда
//			
//			Если ШкНеИспользуется Тогда
//				ТекущийОбъект.Прочитать();
//				ТекущийОбъект.НеИспользуется = Ложь;
//				ЗначениеВДанныеФормы(ТекущийОбъект, Запись);
//			Иначе 
//				Если Модифицированность Тогда
//					Отказ = Истина;
//					ТекстСообщения = НСтр("ru = 'Данный штрих-код уже установлен у данной номенклатуры.'");
//					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Запись.Номенклатура");
//				КонецЕсли;
//			КонецЕсли;
//		КонецЕсли;
//		
//	Иначе
//		
//		СформироватьНовыйШтрихкодEAN13();
//		ЗаполнитьЗначенияСвойств(ТекущийОбъект, Запись, "Штрихкод, ТипШтрихкода");
//		
//	КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
//	
//	Запись.ЕдиницаИзмерения = ЕдиницаНоменклатуры;
//	
//	Если ЗначениеЗаполнено(Запись.Штрихкод)                                                                         // ШК типа EAN13 заполнен
//	 ИЛИ (ЗначениеЗаполнено(Запись.ТипШтрихкода) И Запись.ТипШтрихкода <> ТипШКEAN13) Тогда                         // или тип не EAN13
//		
//		Если ШтрихкодированиеКлиентСервер.ПроверитьШтрихКод(Запись.Штрихкод, Запись.ТипШтрихкода) Тогда             // ШК правильный
//			
//			Если НЕ Элементы.Штрихкод.ТолькоПросмотр И ДублиШтрихкодовРазрешены И Не ЗаписатьДубльШК Тогда
//				
//				// Если возможны дубли ШК, проверяем уникальность ШК на клиенте, иначе - на сервере
//				ПроверитьУникальностьШтрихкода(Запись.Штрихкод, Запись.Номенклатура, Запись.ХарактеристикаНоменклатуры, Запись.ЕдиницаИзмерения, Отказ, ДублиШтрихкодовРазрешены);
//				
//			КонецЕсли;
//			
//		Иначе
//			
//			ТекстСообщения = НСтр("ru = 'Неверно указан тип штрих-кода'");
//			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , "Запись.ТипШтрихкода", , Отказ); 
//			
//		КонецЕсли;
//		
//	Иначе
//		
//		ТекстВопроса = НСтр("ru = 'Штрих-код не заполнен. Сформировать значение штрих-кода автоматически?'");
//		
//		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
//		Если Ответ = КодВозвратаДиалога.Нет Тогда
//			Отказ = Истина;
//		КонецЕсли;
//		
//	КонецЕсли;
//	
//	Если НЕ Отказ Тогда 
//		ПрефиксВесовогоШК = ПолучитьПрефиксВесовогоШК(); 
//		ПрефиксСозданногоШК = Лев(Запись.Штрихкод, 2);
//			
//		Если ПрефиксВесовогоШК = ПрефиксСозданногоШК Тогда
//		   ТекстВопроса = НСтр("ru = '
//									|Штрих-код является весовым.
//									|Продолжить?'");
//						
//			РезультатВыбора = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
//	
//			Если РезультатВыбора = КодВозвратаДиалога.Нет Тогда
//				Отказ = Истина;
//			КонецЕсли;			
//		КонецЕсли;	
//	КонецЕсли;		

//		
//КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Элементы.Номенклатура.ТолькоПросмотр               = Истина;
	Элементы.ХарактеристикаНоменклатуры.ТолькоПросмотр = Истина;
	Элементы.ЕдиницаИзмерения.ТолькоПросмотр           = Истина;
	Элементы.Штрихкод.ТолькоПросмотр                   = Истина;
	
	// Форма узгарганини текширтириб юборади
	ОповеститьОбИзменении(Тип("СправочникСсылка.ХарактеристикиНоменклатуры"));
	
КонецПроцедуры


//&НаКлиенте
//Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
//	Если Источник = "ТорговоеОборудование" И ВводДоступен() И ИмяСобытия = "ScanData" Тогда
//		Штрихкод = Параметр[0].Штрихкод;
//		Если Не Элементы.Штрихкод.ТолькоПросмотр Тогда
//			Запись.Штрихкод = Штрихкод;
//			ШтрихкодПриИзменении(Неопределено);
//		КонецЕсли;
//	КонецЕсли;
//КонецПроцедуры
